app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY score DESC
---
  def index
    @users = User.all.order("score DESC")

INSERT INTO "users" ("created_at", "updated_at", "username", "score") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2022-06-28 19:08:08.725983"], ["updated_at", "2022-06-28 19:08:08.725983"], ["username", "TestUser"], ["score", 999]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save